x=10;
x6=4;
iskeyword
%查找函数说明: 在命令行中输入: help 函数名;

%iskeyword   查找关键字


%特殊变量: ans pi inf/-inf

%利用;来控制是否在命令行中输出(打;时不在命令行,不打则输出)

%字符类型
%数字:整数,浮点数
%字符和字符串''  ""
%矩阵[]
x3=0;

x3*x6;

ch='a';
str="hello world"

ch1='a';
ch2='b';
ch1+ch2
%%%%%%%%%%%%%%%%%%%%%%%%%%%
%1.3.2基本运算符的使用

%+-*/^
ch='a';

%% 矩阵基础

%矩阵创建
%(1)直接输入法
a=[1 2 3;4 5 6;]
%(2)函数创建法
%zeros ones eye 分别是全0,全1,单位矩阵
%rand randi randn 分别是均匀分布的随机数,均匀分布的随机整数,标准正态分布的随机数
b=zeros(4)
c=-zeros(4,3)

d=rand(3)
e=randi([1,6],4,3)%上下限,行,列

f=randn(4,3)
%(3)导入本地文件中的数据
% 主页-导入数据-找一个相关的xlsx即可

%% 矩阵元素的修改与删除
A=[1 2 3 4;2:5;3:6]%2:5就是从2到5
A(2,3)=10%修改单个元素
A(2,:)=10%修改一整行元素
A([1,3],[1,2])=0%修改选定的几个元素
A(5,6)=888%自动拓展

%矩阵元素的删除
A(:,1)=[]%删除一列
A(:,[1,end])=[]%删除第一列和最后一列(end就是最后一列)
A(1)=[]%删除第一个元素,将原来的矩阵变成了一个向量


%% 
%%矩阵拼接重排与重构
%(1)横向拼接:A与B行数相同,用cat(2,A,B)拼接为一个大的矩阵
%(2)纵向拼接:A与B列数相同,用cat(1,A,B)拼接为一个大的矩阵
A=[1 2 3 4;2:5;3:6];
B=ones(3,2);
C=[A,B];%横向拼接是用,
C2=cat(2,A,B);%2横向

B2=ones(2,4);
B3=zeros(3,4);
D=[A;B2;B3];%纵向拼接时用;
D2=cat(1,A,B2);

%矩阵重构
%reshape函数:更改矩阵的形状
A=randi([1,10],2,6);
B=reshape(A,3,4);%数目不能改
B=reshape(A,3,[]);%用一个空向量会使之自动算有几列
%A(:)%将矩阵变成向量
%B(:)

%sort函数: 对向量或者矩阵进行降序排序,在后面加一个输入参数'descend'则变成从大到小降序
%dim=1时,沿着行方向(从上至下)对矩阵每一行升序排序
%dim=2时,沿着列方向(从左到右)对矩阵每一列进行降序排序
sort(A,1)%1是按列排序
sort(A,2)%2是按行
sort(A,1,'descend');


%sortrows函数: 基于矩阵的某一列对矩阵进行排序,同行的元素不会改变
sort(A,2,'descend')
sortrows(A,2,'descend')%对矩阵第2列进行降序排序
sortrows(A,[1,3])%依次对1,3列排序
sortrows(A,[1,3],'descend')
%% 矩阵的运算(1)调用函数运算
clear;
clc;



%sum
A=randi([1,10],3,4)
sum(A,1)%逐列求和(1都代表列)
%ctrl+enter只运行%%之后的代码
sum(A,2)

%以下三种方式均可对所有项求和
sum(sum(A));
sum(A(:));%对所有项求和(将原有矩阵生成一个列向量,然后再对向量求和)
sum(A,"all");


%prod       %求乘积函数
prod(A(:));

%cumsum     %求累计和函数
cumsum(A);   %每一项是原矩阵该列在其之前各项之和
cumsum(A,2);
cumsum(A,2,'reverse');

%diff       %求差分
diff(A);    %每一项是原来这一项与原来的前一项的差
diff(A,2);

%mean       %求平均值
mean(A);    %求列平均值
mean(A,2);

rng('default')
A = randi(10,[4,2,3]);
M = mean(A,2)

%media      %计算中位数
%mode       %计算众数
%var        %计算方差
%std        %计算标准差
%min        %计算最小值
%max        %计算最大值

A = [1.7 1.2 1.5; 1.3 1.6 1.99]
max(A,[],2)     %[] 表示忽略第一个输出参数，即不返回最大值的索引。
max(A)

%% (2)算数运算

clear;
clc;

%乘法
A=randi(10,3,4)
B=randi(10,1,4)
%A*B        %矩阵乘法
%A.*B;      %点乘 
  
%除法
%   /右除(乘右边向量的逆)     \左除     ./点除(对应位置相除)
C=randi(3,2,2)
D=randi(3,2,2)
C./D

%乘方^        点乘方.^(左边在右边对应项次方)
E=randi(3,2,2)
F=randi(3,1,2)
E.^F
E^3     %E*E*E

%矩阵转置
A=[1 2 3+i;2-i 2 3]
A'
A.'


%% (3)关系运算
clear;
clc;
%~=不等于  ==等于    >大于 >=大于等于  <小于     <=小于等于
%真则为1,假则为0

A=[1:4]
B=ones(3,4)
A==B

%% 课后小练






















































